Revit 2027 API
ParameterTypeId.MepEquipmentClassification Property
 "Classification"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepEquipmentClassification { get; }
Public Shared ReadOnly Property MepEquipmentClassification As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepEquipmentClassification {
	ForgeTypeId^ get ();
}
static member MepEquipmentClassification : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace